# Shark Attack Project - Rafael and Victor Jackman

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('./GSAF5.csv', sep=',',encoding='latin-1')

In [3]:
df.shape

(5992, 24)

In [4]:
df.head(2)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2016.09.18.c,18-Sep-16,2016,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,male,M,...,NaN,"Orlando Sentinel, 9/19/2016",2016.09.18.c-NSB.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.18.c,2016.09.18.c,5993,NaN,NaN
1,2016.09.18.b,18-Sep-16,2016,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,Chucky Luciano,M,...,NaN,"Orlando Sentinel, 9/19/2016",2016.09.18.b-Luciano.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.18.b,2016.09.18.b,5992,NaN,NaN

##  Perguntas pra gente basear a limpeza dos dados

In [5]:
print('''Perguntas:
1 - Qual o sexo que tem mais vitimas de tubarões?
2 - Qual o pais em que os tubarões são mais fatais?
''')

Perguntas:
1 - Qual o sexo que tem mais vitimas de tubarões?
2 - Qual o pais em que os tubarões são mais fatais?

### Abaixo começa nosso data cleaning e arrumação dos dados

In [6]:
df.columns=[column.strip() for column in df]

In [7]:
df.columns

Index(['Case Number', 'Date', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex', 'Age', 'Injury', 'Fatal (Y/N)', 'Time',
       'Species', 'Investigator or Source', 'pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22',
       'Unnamed: 23'],
      dtype='object')

In [8]:
df_filtrado=df.loc[:,['Fatal (Y/N)','Sex','Country','Species']]
df_filtrado

     Fatal (Y/N) Sex             Country    Species
0              N   M                 USA        NaN
1              N   M                 USA        NaN
2              N   M                 USA        NaN
3              N   M           AUSTRALIA        NaN
4              N   M           AUSTRALIA  2 m shark
...          ...  ..                 ...        ...
5987           Y   M           AUSTRALIA        NaN
5988           Y   M           AUSTRALIA        NaN
5989           Y   M                 USA        NaN
5990           Y   M              PANAMA        NaN
5991           Y   M  CEYLON (SRI LANKA)        NaN

[5992 rows x 4 columns]

# Cleaning column sex (Question 1)
We are reducing the columns we are manipulating to get a better understanding of the data

In [9]:
df_sex=df_filtrado[['Sex','Fatal (Y/N)']]

In [10]:
df_sex.head(3)

  Sex Fatal (Y/N)
0   M           N
1   M           N
2   M           N

In [11]:
#Verifying distinct values:
df_sex['Sex'].unique()

array(['M', nan, 'F', 'M ', 'lli', 'N', '.'], dtype=object)

In [12]:
#Removing spaces from strings and replacing NaN for 0 (We are assuming the 'N' is meant to be 'M')
df_sex['Sex']=[item.upper().strip() if type(item)==str else 0 for item in df_sex['Sex']]

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [13]:
#Checking if code worked as expected
df_sex['Sex'].unique()

array(['M', 0, 'F', 'LLI', 'N', '.'], dtype=object)

In [14]:
df_sex['Sex']=['M' if item=='N' else item for item in df_sex['Sex']]

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [15]:
#Checking if code worked as expected
df_sex['Sex'].unique()

array(['M', 0, 'F', 'LLI', '.'], dtype=object)

In [16]:
#Changing  misstypes for 0 (Considering only M and F)
df_sex['Sex']=[item if (item=='M')|(item=='F') else 0 for item in df_sex['Sex']]

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [17]:
#Checking if code worked as expected
df_sex['Sex'].unique()

array(['M', 0, 'F'], dtype=object)

In [18]:
df_sex.head(4)

  Sex Fatal (Y/N)
0   M           N
1   M           N
2   M           N
3   M           N

In [19]:
#Changing all the data not related (not a missclick) we found for 0
df_sex['Sex']=[item if (item=='M')|(item=='F') else 0 for item in df_sex['Sex']]

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [20]:
#Removing all lines that has the '0' as key for the column 'Sex', cause it is not 
#measuring anything, once we don't know if the Shark was male or femle.
mask1 = (df_sex['Sex'] == 'F') | (df_sex['Sex']=='M')

In [21]:
mask1

0       True
1       True
2       True
3       True
4       True
        ...
5987    True
5988    True
5989    True
5990    True
5991    True
Name: Sex, Length: 5992, dtype: bool

In [22]:
index_sex = df_sex.loc[~mask1,:].index

In [23]:
df_sex_filtered = df_sex.drop(index_sex)

In [24]:
df_sex_filtered

     Sex Fatal (Y/N)
0      M           N
1      M           N
2      M           N
3      M           N
4      M           N
...   ..         ...
5987   M           Y
5988   M           Y
5989   M           Y
5990   M           Y
5991   M           Y

[5423 rows x 2 columns]

## Cleaning column 'Fatal (Y/N)' (Questions 1 and 2)¶
At this moment, we already have the data for column "Sex" ready to compare, so we are doing the same for column"Fatal (Y/N)"

In [25]:
df_fatal=df_sex_filtered

In [26]:
x = 'Fatal (Y/N)'

In [27]:
df_fatal[x].unique()

array(['N', 'Y', nan, 'UNKNOWN', ' N', '#VALUE!'], dtype=object)

In [28]:
df_fatal.head()

  Sex Fatal (Y/N)
0   M           N
1   M           N
2   M           N
3   M           N
4   M           N

In [29]:
#Removing spaces from strings and replacing NaN for 0 (We disconsidering all the 
#misspelling data from this DF')
df_fatal[x]=[item.upper().strip() if type(item)==str else 0 for item in df_fatal[x]]

In [30]:
df_fatal[x]

0       N
1       N
2       N
3       N
4       N
       ..
5987    Y
5988    Y
5989    Y
5990    Y
5991    Y
Name: Fatal (Y/N), Length: 5423, dtype: object

In [31]:
df_fatal[x].unique()

array(['N', 'Y', 0, 'UNKNOWN', '#VALUE!'], dtype=object)

In [32]:
#Changing all the data not related (not a missclick) we found for 0
df_fatal[x]=[item if (item=='Y')|(item=='N') else 0 for item in df_fatal[x]]

In [33]:
df_fatal[x].unique()

array(['N', 'Y', 0], dtype=object)

In [34]:
df_fatal.head()

  Sex Fatal (Y/N)
0   M           N
1   M           N
2   M           N
3   M           N
4   M           N

In [35]:
#Removing all lines that has the '0' as key for the column 'Sex', cause it is not 
#measuring anything, once we don't know if the Shark was male or female.
mask2 = (df_fatal[x] == 'Y') | (df_fatal[x]=='N')

In [36]:
mask2

0       True
1       True
2       True
3       True
4       True
        ...
5987    True
5988    True
5989    True
5990    True
5991    True
Name: Fatal (Y/N), Length: 5423, dtype: bool

In [37]:
index_fatal = df_fatal.loc[~mask2,:].index

In [38]:
df_fatal_filtered = df_fatal.drop(index_fatal)

In [39]:
df_fatal_filtered

     Sex Fatal (Y/N)
0      M           N
1      M           N
2      M           N
3      M           N
4      M           N
...   ..         ...
5987   M           Y
5988   M           Y
5989   M           Y
5990   M           Y
5991   M           Y

[5356 rows x 2 columns]

In [40]:
df_fatal_filtered=df_fatal_filtered.reset_index(drop=True)

In [41]:
df_fatal_filtered.head(3)

  Sex Fatal (Y/N)
0   M           N
1   M           N
2   M           N

In [42]:
d=[item if(item=='M')|(item=='Y') else 0 for item in df_fatal[x]]

In [43]:
grouped = df_fatal_filtered.groupby(by=['Sex','Fatal (Y/N)'])['Sex'].count()

In [44]:
grouped

Sex  Fatal (Y/N)
F    N               456
     Y               123
M    N              3492
     Y              1285
Name: Sex, dtype: int64

In [45]:
grouped / grouped.groupby(by='Sex').sum()

Sex  Fatal (Y/N)
F    N              0.787565
     Y              0.212435
M    N              0.731003
     Y              0.268997
Name: Sex, dtype: float64

In [46]:
df_fatal_filtered.to_csv('./Shark_treated.csv')

# começando a segunda pergunta aqui
3 - Qual o pais em que os tubarões são mais fatais?

In [47]:
df_filtrado.head(2)

  Fatal (Y/N) Sex Country Species
0           N   M     USA     NaN
1           N   M     USA     NaN

In [48]:
df_pais_fatal = df_filtrado[['Fatal (Y/N)','Country']]

In [49]:
df_pais_fatal.head(4)

  Fatal (Y/N)    Country
0           N        USA
1           N        USA
2           N        USA
3           N  AUSTRALIA

In [50]:
x = 'Fatal (Y/N)'
df_pais_fatal[x].unique()

array(['N', 'Y', nan, 'UNKNOWN', ' N', 'F', 'N ', '#VALUE!', 'n'],
      dtype=object)

In [51]:
df_pais_fatal[x]=[item.upper().strip() if type(item)==str else 0 for item in df_pais_fatal[x]]
df_pais_fatal[x]

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

0       N
1       N
2       N
3       N
4       N
       ..
5987    Y
5988    Y
5989    Y
5990    Y
5991    Y
Name: Fatal (Y/N), Length: 5992, dtype: object

In [52]:
df_pais_fatal[x].unique()

array(['N', 'Y', 0, 'UNKNOWN', 'F', '#VALUE!'], dtype=object)

In [53]:
#Changing all the data not related (not a missclick) we found for 0
df_pais_fatal[x]=[item if (item=='Y')|(item=='N') else 0 for item in df_pais_fatal[x]]

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [54]:
df_pais_fatal[x].unique()

array(['N', 'Y', 0], dtype=object)

In [55]:
#measuring anything, once we don't know if the Shark was male or female.
mask2 = (df_pais_fatal[x] == 'Y') | (df_pais_fatal[x]=='N')
mask2

0       True
1       True
2       True
3       True
4       True
        ...
5987    True
5988    True
5989    True
5990    True
5991    True
Name: Fatal (Y/N), Length: 5992, dtype: bool

In [56]:
index_pais_fatal = df_pais_fatal.loc[~mask2,:].index
df_pais_fatal_filtered = df_pais_fatal.drop(index_pais_fatal)
df_pais_fatal_filtered

     Fatal (Y/N)             Country
0              N                 USA
1              N                 USA
2              N                 USA
3              N           AUSTRALIA
4              N           AUSTRALIA
...          ...                 ...
5987           Y           AUSTRALIA
5988           Y           AUSTRALIA
5989           Y                 USA
5990           Y              PANAMA
5991           Y  CEYLON (SRI LANKA)

[5877 rows x 2 columns]

In [57]:
df_pais_fatal_filtered=df_pais_fatal_filtered.reset_index(drop=True)

In [58]:
df_pais_fatal_filtered

     Fatal (Y/N)             Country
0              N                 USA
1              N                 USA
2              N                 USA
3              N           AUSTRALIA
4              N           AUSTRALIA
...          ...                 ...
5872           Y           AUSTRALIA
5873           Y           AUSTRALIA
5874           Y                 USA
5875           Y              PANAMA
5876           Y  CEYLON (SRI LANKA)

[5877 rows x 2 columns]

In [59]:
#verificando os valores unicos
df_pais_fatal_filtered['Country'].unique()

array(['USA', 'AUSTRALIA', 'NEW CALEDONIA', 'REUNION', 'BAHAMAS', 'SPAIN',
       'CHINA', 'JAPAN', 'COLUMBIA', 'SOUTH AFRICA', 'EGYPT',
       'NEW ZEALAND', 'INDONESIA', 'FRENCH POLYNESIA', 'CAPE VERDE',
       'Fiji', 'BRAZIL', 'DOMINICAN REPUBLIC', 'CAYMAN ISLANDS',
       'UNITED ARAB EMIRATES', 'ARUBA', 'MOZAMBIQUE', 'THAILAND', 'FIJI',
       'PUERTO RICO', 'ITALY', 'MEXICO', 'ATLANTIC OCEAN', 'GREECE',
       'MAURITIUS', nan, 'ST. MARTIN', 'FRANCE', 'ECUADOR',
       'PAPUA NEW GUINEA', 'TRINIDAD & TOBAGO', 'KIRIBATI', 'ISRAEL',
       'DIEGO GARCIA', 'TAIWAN', 'JAMAICA', 'PALESTINIAN TERRITORIES',
       'GUAM', 'SEYCHELLES', 'BELIZE', 'PHILIPPINES', 'NIGERIA', 'TONGA',
       'SCOTLAND', 'CANADA', 'CROATIA', 'SAUDI ARABIA', 'CHILE',
       'ANTIGUA', 'KENYA', 'RUSSIA', 'TURKS & CAICOS', 'COSTA RICA',
       'UNITED KINGDOM', 'MALAYSIA', 'UNITED ARAB EMIRATES (UAE)',
       'SAMOA', 'AZORES', 'SOLOMON ISLANDS', 'SOUTH KOREA', 'MALTA',
       'VIETNAM', 'MADAGASCAR', 'PANAMA', 'SOMALIA', 'NEVIS', 'CUBA',
       'ENGLAND', 'BRITISH VIRGIN ISLANDS', 'NORWAY', 'YEMEN',
       'GULF OF ADEN', 'Sierra Leone', 'ST. MAARTIN', 'GRAND CAYMAN',
       'Seychelles', 'LIBERIA', 'VANUATU', 'MEXICO ', 'HONDURAS',
       'VENEZUELA', 'SRI LANKA', ' TONGA', 'URUGUAY', 'INDIA',
       'MICRONESIA', 'CARIBBEAN SEA', 'OKINAWA', 'TANZANIA',
       'MARSHALL ISLANDS', 'SENEGAL', 'EGYPT / ISRAEL',
       'NORTHERN ARABIAN SEA', 'HONG KONG', 'EL SALVADOR', 'ANGOLA',
       'MONTENEGRO', 'IRAN', 'TUNISIA', 'NAMIBIA', 'BERMUDA',
       'NORTH ATLANTIC OCEAN', 'PORTUGAL', 'SOUTH CHINA SEA',
       'BANGLADESH', 'PALAU', 'WESTERN SAMOA', 'PACIFIC OCEAN ',
       'BRITISH ISLES', 'GRENADA', 'IRAQ', 'TURKEY', 'SINGAPORE',
       'NEW BRITAIN', 'SUDAN', 'JOHNSTON ISLAND', 'SOUTH PACIFIC OCEAN',
       'NEW GUINEA', 'RED SEA', 'NORTH PACIFIC OCEAN',
       'FEDERATED STATES OF MICRONESIA', 'MID ATLANTIC OCEAN',
       'ADMIRALTY ISLANDS', 'BRITISH WEST INDIES', 'SOUTH ATLANTIC OCEAN',
       'PERSIAN GULF', 'RED SEA / INDIAN OCEAN', 'PACIFIC OCEAN',
       'NORTH SEA', 'NICARAGUA ', 'MALDIVE ISLANDS', 'AMERICAN SAMOA',
       'ANDAMAN / NICOBAR ISLANDAS', 'GABON', 'MAYOTTE',
       'NORTH ATLANTIC OCEAN ', 'THE BALKANS', 'SUDAN?', 'ARGENTINA',
       'MARTINIQUE', 'INDIAN OCEAN', 'GUATEMALA', 'NETHERLANDS ANTILLES',
       'NORTHERN MARIANA ISLANDS', 'IRAN / IRAQ', 'JAVA', 'SIERRA LEONE',
       ' PHILIPPINES', 'NICARAGUA', 'CENTRAL PACIFIC',
       'SOLOMON ISLANDS / VANUATU', 'SOUTHWEST PACIFIC OCEAN',
       'BAY OF BENGAL', 'MID-PACIFC OCEAN', 'SLOVENIA', 'CURACAO',
       'ITALY / CROATIA', 'BARBADOS', 'MONACO', 'GUYANA', 'HAITI',
       'SAN DOMINGO', 'IRELAND', 'KUWAIT', 'LIBYA', 'YEMEN ',
       'MEDITERRANEAN SEA?', 'FALKLAND ISLANDS', 'CRETE', 'CYPRUS',
       'EGYPT ', 'BURMA', 'LEBANON', 'PARAGUAY', 'BRITISH NEW GUINEA',
       'OCEAN', 'GEORGIA', 'SYRIA', 'TUVALU', 'INDIAN OCEAN?', 'GUINEA',
       'EQUATORIAL GUINEA / CAMEROON', 'COOK ISLANDS', 'ALGERIA',
       'Coast of AFRICA', 'TASMAN SEA', 'GHANA', 'St Helena', 'GREENLAND',
       'MEDITERRANEAN SEA', 'Between PORTUGAL & INDIA', 'DJIBOUTI',
       'BAHREIN', 'KOREA', 'RED SEA?', 'ASIA?', 'CEYLON (SRI LANKA)'],
      dtype=object)

In [60]:
#Verificando os tipos de dados 
lst=[]
for each in df_pais_fatal_filtered['Country'].unique():
    if type(each) not in lst:
        lst.append(type(each))
    else:
        pass

In [61]:
lst

[str, float]

In [62]:
#Verificando quem são os tipo float
for each in df_pais_fatal_filtered['Country'].unique():
    if type(each) is float:
        print(each)

nan

In [63]:
#jogando para dataframe para trabalhar
df_pais_fatal_filtered['Country'] = pd.DataFrame(df_pais_fatal_filtered['Country'])

In [64]:
df_pais_fatal_filtered.head(8)

  Fatal (Y/N)    Country
0           N        USA
1           N        USA
2           N        USA
3           N  AUSTRALIA
4           N  AUSTRALIA
5           N  AUSTRALIA
6           N        USA
7           N        USA

In [65]:
#Removing spaces from strings and replacing NaN for '0'
df_pais_fatal_filtered['Country']=[item.lower().strip() if type(item)==str else 0 for item in df_pais_fatal_filtered['Country']]

In [66]:
#removing the country name as '0'
mask3= df_pais_fatal_filtered['Country'].apply(lambda x : True if type(x)==str else False)

In [67]:
mask3

0       True
1       True
2       True
3       True
4       True
        ...
5872    True
5873    True
5874    True
5875    True
5876    True
Name: Country, Length: 5877, dtype: bool

In [68]:
index_pais_fatal = df_pais_fatal_filtered.loc[~mask3,:].index
df_pais_fatal_filtered = df_pais_fatal_filtered.drop(index_pais_fatal)
df_pais_fatal_filtered

     Fatal (Y/N)             Country
0              N                 usa
1              N                 usa
2              N                 usa
3              N           australia
4              N           australia
...          ...                 ...
5872           Y           australia
5873           Y           australia
5874           Y                 usa
5875           Y              panama
5876           Y  ceylon (sri lanka)

[5837 rows x 2 columns]

In [69]:
df_pais_fatal_filtered=df_pais_fatal_filtered.reset_index(drop=True)

In [70]:
df_pais_fatal_filtered['Country']

0                      usa
1                      usa
2                      usa
3                australia
4                australia
               ...
5832             australia
5833             australia
5834                   usa
5835                panama
5836    ceylon (sri lanka)
Name: Country, Length: 5837, dtype: object

In [71]:
#Checking if DF still has any Float number in it.
for each in df_pais_fatal_filtered['Country'].unique():
    if type(each) !=str:
        print(each)

In [72]:
df_pais_fatal_filtered['Country']

0                      usa
1                      usa
2                      usa
3                australia
4                australia
               ...
5832             australia
5833             australia
5834                   usa
5835                panama
5836    ceylon (sri lanka)
Name: Country, Length: 5837, dtype: object

In [73]:
#Creating a mask to locate the countrys with NaN numbers
mask =(df_pais_fatal_filtered['Country']==0)

In [74]:
#Counting how many NaN number still in DF
mask.value_counts()

False    5837
Name: Country, dtype: int64

In [75]:
df_pais_fatal_filtered['Country'].unique()

array(['usa', 'australia', 'new caledonia', 'reunion', 'bahamas', 'spain',
       'china', 'japan', 'columbia', 'south africa', 'egypt',
       'new zealand', 'indonesia', 'french polynesia', 'cape verde',
       'fiji', 'brazil', 'dominican republic', 'cayman islands',
       'united arab emirates', 'aruba', 'mozambique', 'thailand',
       'puerto rico', 'italy', 'mexico', 'atlantic ocean', 'greece',
       'mauritius', 'st. martin', 'france', 'ecuador', 'papua new guinea',
       'trinidad & tobago', 'kiribati', 'israel', 'diego garcia',
       'taiwan', 'jamaica', 'palestinian territories', 'guam',
       'seychelles', 'belize', 'philippines', 'nigeria', 'tonga',
       'scotland', 'canada', 'croatia', 'saudi arabia', 'chile',
       'antigua', 'kenya', 'russia', 'turks & caicos', 'costa rica',
       'united kingdom', 'malaysia', 'united arab emirates (uae)',
       'samoa', 'azores', 'solomon islands', 'south korea', 'malta',
       'vietnam', 'madagascar', 'panama', 'somalia', 'nevis', 'cuba',
       'england', 'british virgin islands', 'norway', 'yemen',
       'gulf of aden', 'sierra leone', 'st. maartin', 'grand cayman',
       'liberia', 'vanuatu', 'honduras', 'venezuela', 'sri lanka',
       'uruguay', 'india', 'micronesia', 'caribbean sea', 'okinawa',
       'tanzania', 'marshall islands', 'senegal', 'egypt / israel',
       'northern arabian sea', 'hong kong', 'el salvador', 'angola',
       'montenegro', 'iran', 'tunisia', 'namibia', 'bermuda',
       'north atlantic ocean', 'portugal', 'south china sea',
       'bangladesh', 'palau', 'western samoa', 'pacific ocean',
       'british isles', 'grenada', 'iraq', 'turkey', 'singapore',
       'new britain', 'sudan', 'johnston island', 'south pacific ocean',
       'new guinea', 'red sea', 'north pacific ocean',
       'federated states of micronesia', 'mid atlantic ocean',
       'admiralty islands', 'british west indies', 'south atlantic ocean',
       'persian gulf', 'red sea / indian ocean', 'north sea', 'nicaragua',
       'maldive islands', 'american samoa', 'andaman / nicobar islandas',
       'gabon', 'mayotte', 'the balkans', 'sudan?', 'argentina',
       'martinique', 'indian ocean', 'guatemala', 'netherlands antilles',
       'northern mariana islands', 'iran / iraq', 'java',
       'central pacific', 'solomon islands / vanuatu',
       'southwest pacific ocean', 'bay of bengal', 'mid-pacifc ocean',
       'slovenia', 'curacao', 'italy / croatia', 'barbados', 'monaco',
       'guyana', 'haiti', 'san domingo', 'ireland', 'kuwait', 'libya',
       'mediterranean sea?', 'falkland islands', 'crete', 'cyprus',
       'burma', 'lebanon', 'paraguay', 'british new guinea', 'ocean',
       'georgia', 'syria', 'tuvalu', 'indian ocean?', 'guinea',
       'equatorial guinea / cameroon', 'cook islands', 'algeria',
       'coast of africa', 'tasman sea', 'ghana', 'st helena', 'greenland',
       'mediterranean sea', 'between portugal & india', 'djibouti',
       'bahrein', 'korea', 'red sea?', 'asia?', 'ceylon (sri lanka)'],
      dtype=object)

In [76]:
df_pais_fatal_filtered

     Fatal (Y/N)             Country
0              N                 usa
1              N                 usa
2              N                 usa
3              N           australia
4              N           australia
...          ...                 ...
5832           Y           australia
5833           Y           australia
5834           Y                 usa
5835           Y              panama
5836           Y  ceylon (sri lanka)

[5837 rows x 2 columns]

In [77]:
#We are dropping all the countrys that has less than 1% of attacks, cause it is not going to be relevant to our research
list(zip(df_pais_fatal_filtered['Country'].drop(index_pais_fatal).value_counts().index,df_pais_fatal_filtered['Country'].drop(index_pais_fatal).value_counts().values))

[('usa', 2080),
 ('australia', 1244),
 ('south africa', 558),
 ('papua new guinea', 131),
 ('new zealand', 120),
 ('brazil', 100),
 ('bahamas', 97),
 ('mexico', 82),
 ('italy', 66),
 ('fiji', 63),
 ('philippines', 57),
 ('reunion', 57),
 ('new caledonia', 51),
 ('mozambique', 42),
 ('cuba', 41),
 ('spain', 38),
 ('egypt', 36),
 ('japan', 32),
 ('india', 31),
 ('panama', 30),
 ('croatia', 29),
 ('iran', 29),
 ('solomon islands', 28),
 ('greece', 24),
 ('hong kong', 24),
 ('jamaica', 23),
 ('french polynesia', 22),
 ('indonesia', 19),
 ('pacific ocean', 18),
 ('tonga', 18),
 ('england', 16),
 ('atlantic ocean', 15),
 ('bermuda', 15),
 ('vietnam', 14),
 ('marshall islands', 13),
 ('vanuatu', 13),
 ('costa rica', 12),
 ('sri lanka', 12),
 ('south atlantic ocean', 12),
 ('iraq', 12),
 ('venezuela', 11),
 ('france', 11),
 ('turkey', 11),
 ('senegal', 10),
 ('canada', 10),
 ('united kingdom', 10),
 ('new guinea', 10),
 ('taiwan', 9),
 ('columbia', 9),
 ('sierra leone', 9),
 ('kenya', 9),
 ('yemen', 8),
 ('chile', 8),
 ('seychelles', 8),
 ('ecuador', 8),
 ('south korea', 8),
 ('caribbean sea', 8),
 ('scotland', 8),
 ('tanzania', 8),
 ('mauritius', 7),
 ('samoa', 7),
 ('madagascar', 7),
 ('indian ocean', 7),
 ('nicaragua', 7),
 ('kiribati', 6),
 ('somalia', 6),
 ('okinawa', 6),
 ('dominican republic', 6),
 ('singapore', 6),
 ('north pacific ocean', 6),
 ('new britain', 6),
 ('israel', 5),
 ('barbados', 5),
 ('north atlantic ocean', 5),
 ('thailand', 5),
 ('libya', 5),
 ('azores', 5),
 ('china', 5),
 ('mid atlantic ocean', 5),
 ('saudi arabia', 5),
 ('palau', 5),
 ('turks & caicos', 5),
 ('malaysia', 4),
 ('guam', 4),
 ('sudan', 4),
 ('nigeria', 4),
 ('malta', 4),
 ('persian gulf', 4),
 ('russia', 4),
 ('el salvador', 4),
 ('burma', 4),
 ('uruguay', 3),
 ('montenegro', 3),
 ('guinea', 3),
 ('honduras', 3),
 ('grenada', 3),
 ('belize', 3),
 ('lebanon', 3),
 ('trinidad & tobago', 3),
 ('cape verde', 3),
 ('liberia', 3),
 ('american samoa', 3),
 ('portugal', 3),
 ('namibia', 2),
 ('united arab emirates (uae)', 2),
 ('central pacific', 2),
 ('southwest pacific ocean', 2),
 ('micronesia', 2),
 ('johnston island', 2),
 ('cayman islands', 2),
 ('south pacific ocean', 2),
 ('haiti', 2),
 ('tunisia', 2),
 ('mediterranean sea', 2),
 ('cyprus', 1),
 ('cook islands', 1),
 ('grand cayman', 1),
 ('monaco', 1),
 ('northern mariana islands', 1),
 ('curacao', 1),
 ('british isles', 1),
 ('martinique', 1),
 ('bangladesh', 1),
 ('guatemala', 1),
 ('java', 1),
 ('ocean', 1),
 ('angola', 1),
 ('andaman / nicobar islandas', 1),
 ('mid-pacifc ocean', 1),
 ('syria', 1),
 ('slovenia', 1),
 ('asia?', 1),
 ('italy / croatia', 1),
 ('federated states of micronesia', 1),
 ('south china sea', 1),
 ('diego garcia', 1),
 ('gabon', 1),
 ('aruba', 1),
 ('admiralty islands', 1),
 ('greenland', 1),
 ('ceylon (sri lanka)', 1),
 ('iran / iraq', 1),
 ('st helena', 1),
 ('coast of africa', 1),
 ('maldive islands', 1),
 ('red sea', 1),
 ('the balkans', 1),
 ('northern arabian sea', 1),
 ('mayotte', 1),
 ('bay of bengal', 1),
 ('north sea', 1),
 ('equatorial guinea / cameroon', 1),
 ('british new guinea', 1),
 ('indian ocean?', 1),
 ('norway', 1),
 ('red sea / indian ocean', 1),
 ('united arab emirates', 1),
 ('between portugal & india', 1),
 ('netherlands antilles', 1),
 ('algeria', 1),
 ('georgia', 1),
 ('british virgin islands', 1),
 ('korea', 1),
 ('solomon islands / vanuatu', 1),
 ('falkland islands', 1),
 ('egypt / israel', 1),
 ('argentina', 1),
 ('guyana', 1),
 ('puerto rico', 1),
 ('san domingo', 1),
 ('mediterranean sea?', 1),
 ('paraguay', 1),
 ('british west indies', 1),
 ('ireland', 1),
 ('red sea?', 1),
 ('crete', 1),
 ('ghana', 1),
 ('sudan?', 1),
 ('nevis', 1),
 ('kuwait', 1),
 ('tasman sea', 1),
 ('st. martin', 1),
 ('gulf of aden', 1),
 ('tuvalu', 1),
 ('st. maartin', 1),
 ('western samoa', 1),
 ('palestinian territories', 1),
 ('antigua', 1)]

In [78]:
#We gouped by Fatal (Y) ou Not Fatal (N), and then by Country from the Country with a higher number of cases 
#to the country with lower number of cases.
grouped = df_pais_fatal_filtered[['Fatal (Y/N)','Country']].groupby(by=['Fatal (Y/N)','Country'])['Fatal (Y/N)'].count().sort_values(ascending=False)

In [79]:
grouped.head(20)

Fatal (Y/N)  Country
N            usa                 1842
             australia            910
             south africa         422
Y            australia            341
             usa                  246
             south africa         137
N            new zealand           94
             bahamas               86
             papua new guinea      75
             brazil                60
Y            papua new guinea      56
N            italy                 48
Y            mexico                43
             brazil                40
N            fiji                  40
             mexico                39
Y            philippines           38
N            new caledonia         32
             reunion               30
             spain                 29
Name: Fatal (Y/N), dtype: int64

In [80]:
# The country with the biggest cases of fatal attacks is Australia, with 341 cases, 
#followed by USA with 246 cases, and  South Africa with 137 cases.

In [81]:
grouped.to_csv('./Shark_treated2.csv')